app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"  ORDER BY Created_at DESC
---
    def index
        @post = Post.all.order("Created_at DESC")

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Test"], ["description", "Test"], ["created_at", "2016-12-27 11:04:00.347746"], ["updated_at", "2016-12-27 11:04:00.347746"]]
---
    def create
        @post = Post.new(post_params)
        if @post.save

UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["description", "Test1"], ["updated_at", "2016-12-27 11:12:53.765396"], ["id", 1]]
---
    def update
        if @post.update(post_params)